Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.1.68/edc/PIC32MK0256MCJ048.PIC
      <edc:DCRDef edc:_addr="0x1FC03F4C" edc:access="-n--nnnnnnnnnnnnnnnn-nnn-nnnnnnn" edc:cname="ADEVCFG0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x4ffff77b" edc:name="ADEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7fffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Trace features in the CPU are enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Trace features in the CPU are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot ISA Selection" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:desc="Dynamic Flash ECC Configuration Bits" edc:mask="0x3" edc:name="FECCCON" edc:nzwidth="0x2">
              <edc:AliasList/>
              <edc:DCRFieldSemantic edc:cname="ECC_DECC_DISABLE_ECCON_WRITABLE" edc:desc="ECC and Dynamic ECC are disabled (ECCCON&lt;1:0&gt; bits are writable)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ECC_DECC_DISABLE_ECCON_LOCKED" edc:desc="ECC and Dynamic ECC are disabled (ECCCON&lt;1:0&gt; bits are locked)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DECC_ENABLE" edc:desc="Dynamic Flash ECC is enabled (ECCCON&lt;1:0&gt; bits are locked)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ECC_ENABLE" edc:desc="Flash ECC is enabled (ECCCON&lt;1:0&gt; bits are locked; disables word Flash writes)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FSLEEP" edc:desc="Flash Sleep Mode" edc:mask="0x1" edc:name="FSLEEP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="VREGS" edc:desc="Flash power down is controlled by the VREGS bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Flash is powered down when the device is in Sleep mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="DBGPER" edc:desc="Debug Mode CPU Access Permission" edc:mask="0x7" edc:name="DBGPER" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG2" edc:desc="Allow CPU access to Permission Group 2 permission regions" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG1" edc:desc="Allow CPU access to Permission Group 1 permission regions" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG0" edc:desc="Allow CPU access to Permission Group 0 permission regions" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PG_1_0" edc:desc="PG0: Allow PG1: Allow PG2: Deny" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_0" edc:desc="PG0: Allow PG1: Deny PG2: Allow" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_1" edc:desc="PG0: Deny PG1: Allow PG2: Allow" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PG_ALL" edc:desc="Allow CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PG_NONE" edc:desc="Deny CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Soft Master Clear Enable" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR pin generates an emulated POR Reset" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="MCLR pin generates a normal system Reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCGAIN" edc:desc="Secondary Oscillator Gain Control bits" edc:mask="0x3" edc:name="SOSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="G3" edc:desc="Gain is G3" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="G2" edc:desc="Gain is G2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="G1" edc:desc="Gain is G1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="G0" edc:desc="Gain is G0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCBOOST" edc:desc="Secondary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="SOSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCGAIN" edc:desc="Primary Oscillator Coarse Gain Control bits" edc:mask="0x3" edc:name="POSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="G3" edc:desc="Gain Level 3 (highest)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="G2" edc:desc="Gain Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="G1" edc:desc="Gain Level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="G0" edc:desc="Gain Level 0 (Lowest)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCBOOST" edc:desc="Primary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="POSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCFGAIN" edc:desc="Primary Oscillator Fine Gain Control bits" edc:mask="0x3" edc:name="POSCFGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="G3" edc:desc="Gain is G3" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="G2" edc:desc="Gain is G2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="G1" edc:desc="Gain is G1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="G0" edc:desc="Gain is G0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCAGCDLY" edc:desc="AGC Gain Search Step Settling Time Control" edc:mask="0x3" edc:name="POSCAGCDLY" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="AGCRNG_x_25ms" edc:desc="Settling time = 25ms x AGCRNG" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="AGCRNG_x_6_25ms" edc:desc="Settling time = 6.25ms x AGCRNG" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="AGCRNG_x_400ms" edc:desc="Settling time = 400ms x AGCRNG" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="AGCRNG_x_100ms" edc:desc="Settling time = 100ms x AGCRNG" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCAGCRNG" edc:desc="AGC Lock Range bit" edc:mask="0x1" edc:name="POSCAGCRNG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ONE_X" edc:desc="Range 1x" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FIVE_X" edc:desc="Range 5x" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCAGC" edc:desc="Primary Oscillator Gain Control bit" edc:mask="0x1" edc:name="POSCAGC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="Automatic" edc:desc="Automatic Gain Control for Oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="Manual" edc:desc="Manual Gain Control of Oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="EJTAGBEN" edc:desc="EJTAG Boot Enable" edc:mask="0x1" edc:name="EJTAGBEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="REDUCED" edc:desc="Reduced EJTAG functionality" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="Normal EJTAG functionality" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x1FC03F50" edc:offset="0xc"/>
      <edc:DCRDef edc:_addr="0x1FC03F5C" edc:access="---n----------------------------" edc:cname="ADEVCP" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x10000000" edc:name="ADEVCP" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x10000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0x80" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0x0" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x1FC03F60" edc:offset="0xc"/>
      <edc:DCRDef edc:_addr="0x1FC03F6C" edc:access="--------------------------------" edc:cname="ADEVSIGN" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x0" edc:name="ADEVSIGN" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC03F70" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ASEQ" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="ASEQ" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc03fb0" edc:endaddr="0x1fc04000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliasconfig">
      <edc:AdjustPoint edc:_addr="0x1FC03FB0" edc:offset="0x10"/>
      <edc:DCRDef edc:_addr="0x1FC03FC0" edc:access="nnnnn------n----nnnnnnnnnnnnnnnn" edc:cname="DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf810ffff" edc:name="DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:DCRFieldDef edc:cname="PWMLOCK" edc:desc="PWM IOxCON lock" edc:mask="0x1" edc:name="PWMLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM IOxCON register write accessess must use the PWMKEY unlock proceedure" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM IOxCON register writes accesses are not locked or protected" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration bit" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO1" edc:desc="USB1 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO1" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
